(ns max.index
  (:require
   [hiccup2.core :as hiccup]
   
   [max.helper :as helper]
   [max.text-processor :as text-processor]))

(def titles
  ["Сайт-визитка Максима Саковича"
   "Портфолио звукорежиссера М. Саковича"
   "Здесь могла быть ваша реклама"
   "Объект культурного наследия. Охраняется государством. Ведется видеонаблюдение."
   "Студия аддиктивных технологий Максима Саковича"
   "There is nothing here! Здесь ничего нет! 這裡什麼都沒有!"
   "Бесплатный сайт Максима Саковича"
   "Сайт содержит информацию"
   "Ошибка 508. Перезагрузите смартфон."
   "Вы используете последнюю версию сайта"
   "Пожалуйста, поверните устройство"
   "Перезагрузите страницу"
   "Запись, сведение, песни под ключ"
   "Официальный сайт Максима Саковича"
   "Meeeeeeeeeeeeeeeeeeee:3"
   "Сайт Максима Саковича работает круглосуточно, без перерывов и выходных"
   "Звукорежиссер Максим Сакович"
   "Пожертвования на реставрацию сайта Максима Саковича принимаются в валюте Российской Федерации"
   "Эзотерика, философия, психология, нетрадиционная медицина, йога, цигун, боевые искусства, астрология, магия, руны, таро, благовония, аромотерапия, фэн-шуй, амулеты, сувениры, этническая и медитативная музыка"
   "Давайте лучше встретимся"
   "Индивидуальный предприниматель Сакович Максим Дмитриевич. ИНН 346100829639, ОГРНИП 322344300018033."
   "Битмейкер Максим Сакович"
   "Дискография группы «Максим Сакович»"
   "Сайт содержит нецензурную брань"
   "Я не использую куки"
   "Здравствуйте!"
   "Спасибо!"
   "Курение возле сайта Максима Саковича запрещено"
   "Ищу подработку"])


(defn page-index
  [request]
  (helper/html-response request
    (hiccup/html 
      [:div
                [:h1.center 
                  (-> titles
                      shuffle
                      first)
                
                [:br] [:br]
                 
                [:div.column
                  
                  [:p "Написал более 50 треков в составе группы «" 
                   [:a {:href "https://t.me/limonadny_zavod"} "Максим Толстов"] "»."]

                  [:p "Автоматизировал свою жизнь при помощи " 
                   [:a {:href "https://github.com/tapochqa?tab=repositories"} "пет-проектов на кложе"] "."]
                  
                  [:p "В свободное время профессионально пью чай."]
                    
                  [:p "У меня есть " [:a {:href "https://vk.ru/meloxicam"} "вк"] 
                   ". У меня есть " 
                   [:a {:href "https://www.instagram.com/briskovi4"} "инста"] 
                   ". <-- инстаграм — террористы! и враги"]
                  [:p "У меня есть " 
                   [:a {:href "https://www.avito.ru/brands/1cee57cc05efe1fa331bdf1c7813fe5b"} "авито"] 
                   ". У меня есть " 
                   [:a {:href "https://www.youtube.com/@TAPOCHQA"} "ютуб"] 
                   "."]
                  [:p "У меня есть электропочта " 
                   [:a {:href "mailto:max@limonadny.ru"} "max@limonadny.ru"] 
                   ". И лс "
                   [:a {:href "https://t.me/briskovic"} "в телеге"]
                   "."]

                   [:br] [:br]

                   [:p.center "--------------------------"]

                   [:br] [:br]

                   (map hiccup/raw (text-processor/index "../max-img/txt"))]]]
      
      
      
      
      
      
      )))